app/services/enrolment_service.rb

SELECT `batches`.* FROM `batches` WHERE `batches`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT 1 AS one FROM `enrolment_requests` WHERE `enrolment_requests`.`batch_id` = 2 AND `enrolment_requests`.`student_id` = 3 LIMIT 1
INSERT INTO `enrolment_requests` (`student_id`, `batch_id`, `created_at`, `updated_at`) VALUES (3, 2, '2023-05-07 14:55:44.702476', '2023-05-07 14:55:44.702476')
---
  def self.create_enrollment(batch_id, user_id)
    batch = Batch.find(batch_id)
    user = User.find(user_id)

    if batch.start_date < Date.today
      return { success: false, message: "Batch has already started" }
    end

    if EnrolmentRequest.exists?(batch_id: batch_id, student_id: user_id)
      return { success: false, message: "Enrollment request already exists" }
    end

    EnrolmentRequest.create(batch_id: batch_id, student_id: user_id)