app/controllers/admin/batches_controller.rb

  def index
    if current_user.admin?
      @batches = Batch.all
    else
      @batches = Batch.joins(:course => :school)
      .where(:schools => {:id => current_user.schools.pluck(:id)})
---
SELECT `batches`.* FROM `batches`
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2

  def create
    @batch = Batch.new(batch_params)

    respond_to do |format|
      if @batch.save
---
INSERT INTO `batches` (`start_date`, `end_date`, `course_id`, `created_at`, `updated_at`, `name`) VALUES ('2023-05-08', '2023-05-08', 1, '2023-05-08 13:58:02.735592', '2023-05-08 13:58:02.735592', '')

  def update
    respond_to do |format|
      if @batch.update(batch_params)
---
UPDATE `batches` SET `batches`.`name` = 'dsdfs', `batches`.`updated_at` = '2023-05-07 13:18:41.653791' WHERE `batches`.`id` = 1

  def destroy
    @batch.destroy
---
DELETE FROM `batches` WHERE `batches`.`id` = 6

    def set_batch
      @batch = Batch.find(params[:id])
      if current_user.admin?
        @courses = Course.all
      else
        @courses = Course.joins(:school).where(schools: { id: current_user.schools.pluck(:id) })
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`id` = 6 LIMIT 1
SELECT `courses`.* FROM `courses`
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2