app/controllers/admin/courses_controller.rb

SELECT `courses`.* FROM `courses`
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2
---
  def index
    if current_user.admin?
      @courses = Course.all
    else
      @courses = Course.joins(:school).where(schools: { id: current_user.schools.pluck(:id) })

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2
---
    def set_course
      @course = Course.find(params[:id])
      if current_user.admin?
        @courses = Course.all
      else
        @courses = Course.joins(:school).where(schools: { id: current_user.schools.pluck(:id) })