app/controllers/admin/enrolment_requests_controller.rb

  def index
    if current_user.admin?
      @enrolment_requests = EnrolmentRequest.all
    else
      @enrolment_requests = EnrolmentRequest.joins(batch: { course: :school })
                                        .where(schools: { id: current_user.schools.pluck(:id) })
---
SELECT `enrolment_requests`.* FROM `enrolment_requests`
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2

  def create
    @enrolment_request = EnrolmentRequest.new(enrolment_request_params)

    respond_to do |format|
      if @enrolment_request.save
---
INSERT INTO `enrolment_requests` (`student_id`, `batch_id`, `created_at`, `updated_at`, `status`) VALUES (18, 1, '2023-05-08 12:10:08.608051', '2023-05-08 12:10:08.608051', 1)

  def update
    respond_to do |format|
      if @enrolment_request.update(enrolment_request_params)
---
UPDATE `enrolment_requests` SET `enrolment_requests`.`batch_id` = 1, `enrolment_requests`.`updated_at` = '2023-05-08 14:08:57.516205' WHERE `enrolment_requests`.`id` = 14

  def approve
    @enrolment_request.update(status: "approved")
---
UPDATE `enrolment_requests` SET `enrolment_requests`.`status` = 2, `enrolment_requests`.`updated_at` = '2023-05-07 13:46:03.563535' WHERE `enrolment_requests`.`id` = 1

  def reject
    @enrolment_request.update(status: "rejected")
---
UPDATE `enrolment_requests` SET `enrolment_requests`.`status` = 2, `enrolment_requests`.`updated_at` = '2023-05-08 14:30:37.456480' WHERE `enrolment_requests`.`id` = 14

    def set_enrolment_request
      @enrolment_request = EnrolmentRequest.find(params[:id])
      if current_user.admin?
        @batches = Batch.all
      else
        @batches = Batch.joins(:course => :school)
        .where(:schools => {:id => current_user.schools.pluck(:id)})
---
SELECT `enrolment_requests`.* FROM `enrolment_requests` WHERE `enrolment_requests`.`id` = 14 LIMIT 1
SELECT `batches`.* FROM `batches`
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 1