app/controllers/admin/schools_controller.rb

SELECT `schools`.* FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2
---
  def index
    if current_user.schooladmin?
      @schools = current_user.schools
    else
      @schools = School.all

INSERT INTO `schools` (`name`, `address`, `contact_details`, `created_at`, `updated_at`) VALUES ('hidkq', 'knsacfk', 'ckc', '2023-05-07 11:16:19.380832', '2023-05-07 11:16:19.380832')
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save

UPDATE `schools` SET `schools`.`name` = 'School1', `schools`.`updated_at` = '2023-05-07 14:07:24.791028' WHERE `schools`.`id` = 2
---
  def update
    respond_to do |format|
      if @school.update(school_params)

DELETE FROM `schools` WHERE `schools`.`id` = 5
---
  def destroy
    @school.destroy

SELECT `schools`.* FROM `schools` WHERE `schools`.`id` = 7 LIMIT 1
SELECT `schools`.* FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2 AND `schools`.`id` = 1 LIMIT 1
---
    def set_school
      if current_user.admin?
        @school = School.find(params[:id])
      else
        @school = current_user.schools.find(params[:id])