app/controllers/admin/school_admins_controller.rb

  def index
    @school_admins = SchoolAdmin.all
---
SELECT `school_admins`.* FROM `school_admins`

  def create
    @school_admin = SchoolAdmin.new(school_admin_params)

    respond_to do |format|
      if @school_admin.save
---
INSERT INTO `school_admins` (`user_id`, `school_id`, `created_at`, `updated_at`) VALUES (2, 1, '2023-05-07 13:32:01.136420', '2023-05-07 13:32:01.136420')

  def destroy
    @school_admin.destroy
---
DELETE FROM `school_admins` WHERE `school_admins`.`id` = 4

    def set_school_admin
      @school_admin = SchoolAdmin.find(params[:id])
---
SELECT `school_admins`.* FROM `school_admins` WHERE `school_admins`.`id` = 1 LIMIT 1