app/controllers/admin/users_controller.rb

UPDATE `users` SET `users`.`name` = 'Atish', `users`.`phone_number` = '', `users`.`encrypted_password` = '$2a$12$pseKRMivZeL7D0RmHGdKuOcYhoaUnI0nFyDKeyk5h6YivPXfBynp2', `users`.`updated_at` = '2023-05-07 12:02:57.011784' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)