app/views/admin/enrolment_requests/_form.html.erb

    <% if current_user.schooladmin? %>
      <%= form.collection_select :batch_id, Batch.joins(:course => :school)
        .where(:schools => {:id => current_user.schools.pluck(:id)}), :id, :name, {}, class: "form-control" %>
    <% else %>
      <%= form.collection_select :batch_id, Batch.all, :id, :name, {}, class: "form-control" %>
---
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2
SELECT `batches`.* FROM `batches`

    <%= form.label :student_id %>
    <%= form.collection_select :student_id, User.all, :id, ->(user) { "#{user.name} (#{user.email})" }, {}, class: "form-control" %>
---
SELECT `users`.* FROM `users`