app/controllers/api/v1/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 980190962 ORDER BY `users`.`id` ASC LIMIT 1

  def update
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 980190962 ORDER BY `users`.`id` ASC LIMIT 1

  def destroy
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 980190962 ORDER BY `users`.`id` ASC LIMIT 1