app/views/admin/batches/_form.html.erb

    <% if current_user.schooladmin? %>
      <%= form.collection_select :course_id, Course.joins(:school).where(schools: { id: current_user.schools.pluck(:id) }), :id,:name %>
    <% else %>
      <%= form.collection_select :course_id, Course.all, :id, :name, {}, class: "form-control" %>
---
SELECT `schools`.`id` FROM `schools` INNER JOIN `school_admins` ON `schools`.`id` = `school_admins`.`school_id` WHERE `school_admins`.`user_id` = 2
SELECT `courses`.* FROM `courses`