app/controllers/batches_controller.rb

SELECT `batches`.* FROM `batches` WHERE `batches`.`id` IN (2, 4)
SELECT `enrolment_requests`.* FROM `enrolment_requests` WHERE `enrolment_requests`.`user_id` = 1
---
  def current_user_batches
    @batches = current_user.enrolment_requests.includes(:batch).map(&:batch)

SELECT `batches`.* FROM `batches` WHERE `batches`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show_users
    @batch = Batch.find(params[:id])
    @users = @batch.users.where.not(id: current_user.id)