app/views/admin/users/_form.html.erb

    <%= form.label :role_id, class: "control-label" %>
    <%= form.collection_select :role_id, Role.all, :id, :name, {}, class: "form-control" %>
---
SELECT `roles`.* FROM `roles`