app/views/admin/school_admins/_form.html.erb

SELECT `schools`.* FROM `schools`
---
    <%= form.label :school_id %>
    <%= form.collection_select :school_id, School.all, :id, :name, {}, { class: "form-control" } %>