app/views/admin/courses/_form.html.erb

          <% else %>
            <%= f.collection_select :school_id, School.all, :id, :name, {}, class: "form-control" %>
---
SELECT `schools`.* FROM `schools`